# PROBLEM STATEMENT

To find whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [4]:
import pandas as pd
from scipy import stats

In [5]:
data = pd.read_csv("C:\\Users\\nilka\\OneDrive\\Desktop\\excelr\\self paced course\\data science assignment\\1.assignments\\3.hypothesis testing\\LabTAT.csv")

In [6]:
data.head()

   Laboratory_1  Laboratory_2  Laboratory_3  Laboratory_4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory_1  120 non-null    float64
 1   Laboratory_2  120 non-null    float64
 2   Laboratory_3  120 non-null    float64
 3   Laboratory_4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [9]:
data.describe()

       Laboratory_1  Laboratory_2  Laboratory_3  Laboratory_4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

# Hypothesis Statement

H0:  there is no difference in average TAT among the different laboratories 
H1:  there is siginificant difference in average TAT among the different laboratories

In [10]:
# We need to perform ANOVA TEST since we have to compare between more than 2 samples

In [11]:
stats.f_oneway(data.Laboratory_1,data.Laboratory_2,data.Laboratory_3,data.Laboratory_4)

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

p value = 2.11e-57
since  p < 0.05 we reject H0  
Thus there is significant difference in average TAT among different laboratories